doc/slides/slide_pointeur.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Pointeurs, Références &amp; Allocation Dynamique de Mémoire</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Pointeurs, Références &amp; Allocation Dynamique de Mémoire</h1><hr/>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Rappels sur les adresses et pointeurs</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<ul class="org-ul">
<li>Tout objet manipulé par l&rsquo;ordinateur est stocké en mémoire. Selon la nature de
l&rsquo;objet, l&rsquo;espace en mémoire alloué varie : par ex., entier = 32 ou 64 bits
</li>

<li><b>L&rsquo;adresse</b> est l&rsquo;endroit où se trouve la variable en mémoire. Elle s&rsquo;obtient
via la syntaxe suivante : <code>&amp;NomDeLaVariable</code>
</li>

<li>L&rsquo;adresse n&rsquo;étant ni plus ni moins qu&rsquo;une valeur, on peut donc stocker cette
valeur dans une variable : <b>un pointeur</b> est ainsi un conteneur d&rsquo;adresse
</li>

<li><p>
Déclaration d&rsquo;un pointeur :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-variable-name">i</span> = 10;
<span class="org-type">int</span> * <span class="org-variable-name">pt_i</span> = &amp;i;
<span class="org-type">int</span> <span class="org-variable-name">j</span> = *pt_i;
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Notion de référence en C++</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Le C++ introduit la notion de référence afin de faciliter la manipulation des
variables
</p>
</div>

<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Pointeur</h3>
<div class="outline-text-3" id="text-unnumbered-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Pointeur</span>
<span class="org-type">int</span> <span class="org-variable-name">i</span> = 10;
<span class="org-type">int</span> * <span class="org-variable-name">pt_i</span> = &amp;i;
(*pt_i)++;
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">Référence</h3>
<div class="outline-text-3" id="text-unnumbered-4">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">R&#233;f&#233;rence</span>
<span class="org-type">int</span> <span class="org-variable-name">i</span> = 10;
<span class="org-type">int</span> &amp; <span class="org-variable-name">ref_i</span> = i;
ref_i++;
</pre>
</div>

<ul class="org-ul">
<li>La déclaration d&rsquo;une référence ne crée pas de nouvel objet
</li>

<li>Toute référence doit se référer à un identificateur : <code>int &amp; ref_i;</code> ne
compilera pas. Il est nécessaire <b>d&rsquo;initialiser</b> une référence.
</li>

<li>Une référence pointe toujours vers le même objet, on ne peut pas changer sa
destination.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">Références en tant qu&rsquo;arguments de fonctions</h2>
<div class="outline-text-2" id="text-unnumbered-5">
</div><div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">Transmission par adresse</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">echange</span>(<span class="org-type">int</span> * <span class="org-variable-name">a</span>, <span class="org-type">int</span> * <span class="org-variable-name">b</span>)
{
  <span class="org-type">int</span> <span class="org-variable-name">c</span> = *a;
  *a = *b;
  *b = c;
}
...
<span class="org-type">int</span> x = 10;
<span class="org-type">int</span> <span class="org-variable-name">y</span> = 20;
echange(&amp;x, &amp;y);
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-3">
<h3 id="unnumbered-7">Transmission par référence</h3>
<div class="outline-text-3" id="text-unnumbered-7">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">echange</span>(<span class="org-type">int</span> &amp; <span class="org-variable-name">a</span>, <span class="org-type">int</span> &amp; <span class="org-variable-name">b</span>)
{
  <span class="org-type">int</span> <span class="org-variable-name">c</span> = a;
  a = b;
  b = c;
}
...
<span class="org-type">int</span> x = 10;
<span class="org-type">int</span> <span class="org-variable-name">y</span> = 20;
echange(x, y);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-2">
<h2 id="unnumbered-8">Allocation dynamique de mémoire</h2>
<div class="outline-text-2" id="text-unnumbered-8">
<p>
L&rsquo;allocation dynamique de mémoire est nécessaire dès lors que la taille d&rsquo;un
objet (ou sa nature) n&rsquo;est connue que lors de l&rsquo;exécution du programme. La
déclaration
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">n</span>;
<span class="org-constant">std</span>::cin &gt;&gt; n;
<span class="org-type">double</span> <span class="org-variable-name">tableau</span>[n];
</pre>
</div>

<p>
est rejetée du fait que le compilateur ne connait pas, au préalable, l&rsquo;espace
mémoire nécessaire à l&rsquo;allocation (statique).
</p>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-2">
<h2 id="unnumbered-9">Utilisation des opérateurs <code>new</code> et <code>delete</code></h2>
<div class="outline-text-2" id="text-unnumbered-9">
<ul class="org-ul">
<li>Pour rappel, en langage C, la gestion dynamique de mémoire fait appel aux
fonctions <code>malloc</code> et <code>free</code> (librairie <code>stdlib.h</code>)
</li>

<li>C++ propose deux nouveaux opérateurs :

<ul class="org-ul">
<li><p>
<code>new</code> alloue une certaine quantité de mémoire et renvoie un pointeur sur le
début du tableau :
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">n</span>;
<span class="org-constant">std</span>::cin &gt;&gt; n;
<span class="org-type">double</span> * <span class="org-variable-name">tableau</span> = <span class="org-keyword">new</span> <span class="org-type">double</span>[n];
</pre>
</div>
</li>

<li><p>
<code>delete[]</code> libère l&rsquo;espace mémoire :
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">delete</span>[] tableau;
</pre>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-2">
<h2 id="unnumbered-10">Portée &amp; Durée de vie des variables</h2>
<div class="outline-text-2" id="text-unnumbered-10">
</div><div id="outline-container-unnumbered-11" class="outline-3">
<h3 id="unnumbered-11">Durée de vie limitée au bloc (ici boucle <code>for</code>)</h3>
<div class="outline-text-3" id="text-unnumbered-11">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; i++) {
  <span class="org-type">int</span> <span class="org-variable-name">k</span> = 0;
  <span class="org-comment-delimiter">// </span><span class="org-comment">&#192; la fin du bloc,</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">destruction de k</span>
 }
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-12" class="outline-3">
<h3 id="unnumbered-12">Durée de vie indépendante du bloc</h3>
<div class="outline-text-3" id="text-unnumbered-12">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; i++) {
  <span class="org-type">int</span> * <span class="org-variable-name">k</span> = <span class="org-keyword">new</span> <span class="org-type">int</span>(0);
  <span class="org-comment-delimiter">// </span><span class="org-comment">&#192; la fin du bloc,</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">k existe en m&#233;moire</span>
 }
</pre>
</div>

<div class="CBOX">
<p>
Fuite de mémoire garantie
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-13" class="outline-2">
<h2 id="unnumbered-13">Portée &amp; Durée de vie des variables</h2>
<div class="outline-text-2" id="text-unnumbered-13">
</div><div id="outline-container-unnumbered-14" class="outline-3">
<h3 id="unnumbered-14">Durée de vie limitée au bloc (ici boucle <code>for</code>)</h3>
<div class="outline-text-3" id="text-unnumbered-14">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; i++) {
  <span class="org-type">int</span> <span class="org-variable-name">k</span> = 0;
  <span class="org-comment-delimiter">// </span><span class="org-comment">&#192; la fin du bloc,</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">destruction de k</span>
 }
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-15" class="outline-3">
<h3 id="unnumbered-15">Durée de vie indépendante du bloc</h3>
<div class="outline-text-3" id="text-unnumbered-15">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; i++) {
  <span class="org-type">int</span> * <span class="org-variable-name">k</span> = <span class="org-keyword">new</span> <span class="org-type">int</span>(0);
  <span class="org-keyword">delete</span> k;

 }
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-unnumbered-16" class="outline-2">
<h2 id="unnumbered-16">Portée &amp; Durée de vie des variables</h2>
<div class="outline-text-2" id="text-unnumbered-16">
</div><div id="outline-container-unnumbered-17" class="outline-3">
<h3 id="unnumbered-17">Allocation sur la pile (“stack”)</h3>
<div class="outline-text-3" id="text-unnumbered-17">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> * <span class="org-function-name">pointeur_dix</span>()
{
  <span class="org-type">int</span> <span class="org-variable-name">a</span> = 10;
  <span class="org-keyword">return</span> &amp;a;  <span class="org-comment-delimiter">// </span><span class="org-comment">incorrect !</span>
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">int</span> * <span class="org-variable-name">pb</span> = pointeur_dix();
  cout &lt;&lt; *pb &lt;&lt; endl;

  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="CBOX">
<p>
Le pointeur retourné contient une adresse obsolète
</p>

</div>
</div>
</div>

<div id="outline-container-unnumbered-18" class="outline-3">
<h3 id="unnumbered-18">Allocation sur le tas (“heap”)</h3>
<div class="outline-text-3" id="text-unnumbered-18">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> * <span class="org-function-name">pointeur_dix</span>()
{
  <span class="org-type">int</span> * <span class="org-variable-name">pa</span> = <span class="org-keyword">new</span> <span class="org-type">int</span>(10);
  <span class="org-keyword">return</span> pa;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">int</span> * <span class="org-variable-name">pb</span> = pointeur_dix();
  cout &lt;&lt; *pb &lt;&lt; endl;
  <span class="org-keyword">delete</span> pb;
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
